app/Models/BookModel.php

SELECT *
FROM `books`
---
    public function getBook($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();