app/Models/UserModel.php

    public function getUserByEmail($email)
    {
        return $this->where(['email' => $email])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'gkthakur2922@gmail.com'
 LIMIT 1